In [157]:
import pandas as pd
import numpy as np

In [158]:
df = pd.read_csv("insurance.csv")
df.head()

   age     sex     bmi  children smoker     region      charges
0   19  female  27.900         0    yes  southwest  16884.92400
1   18    male  33.770         1     no  southeast   1725.55230
2   28    male  33.000         3     no  southeast   4449.46200
3   33    male  22.705         0     no  northwest  21984.47061
4   32    male  28.880         0     no  northwest   3866.85520

In [159]:
df["sex"].unique()

array(['female', 'male'], dtype=object)

In [160]:
df["smoker"].unique()

array(['yes', 'no'], dtype=object)

In [161]:
df["region"].unique()

array(['southwest', 'southeast', 'northwest', 'northeast'], dtype=object)

In [162]:
df.shape

(1338, 7)

In [163]:
df.isnull().sum()

age         0
sex         0
bmi         0
children    0
smoker      0
region      0
charges     0
dtype: int64

In [164]:
df1 = df.copy()
df2 = df.copy()
df3 = df.copy()
df4 = df.copy()
df5 = df.copy()
df6 = df.copy()

Label Encoder

In [165]:
from sklearn.preprocessing import LabelEncoder
le = LabelEncoder()

In [166]:
df.columns

Index(['age', 'sex', 'bmi', 'children', 'smoker', 'region', 'charges'], dtype='object')

In [167]:
#loop
from pandas.core.dtypes.common import is_numeric_dtype

In [168]:
for col in df.columns:
    if is_numeric_dtype(df[col]):
        continue
    else:
        df[col] = le.fit_transform(df[col])

In [169]:
df.head()

   age  sex     bmi  children  smoker  region      charges
0   19    0  27.900         0       1       3  16884.92400
1   18    1  33.770         1       0       2   1725.55230
2   28    1  33.000         3       0       2   4449.46200
3   33    1  22.705         0       0       1  21984.47061
4   32    1  28.880         0       0       1   3866.85520

One Hot Encoding

In [170]:
df2.head()

   age     sex     bmi  children smoker     region      charges
0   19  female  27.900         0    yes  southwest  16884.92400
1   18    male  33.770         1     no  southeast   1725.55230
2   28    male  33.000         3     no  southeast   4449.46200
3   33    male  22.705         0     no  northwest  21984.47061
4   32    male  28.880         0     no  northwest   3866.85520

In [171]:
new_sex = pd.get_dummies(df2["sex"])

In [172]:
new_sex.head()

   female  male
0       1     0
1       0     1
2       0     1
3       0     1
4       0     1

In [173]:
new_smoker = pd.get_dummies(df2["smoker"])

In [174]:
new_smoker.head()

   no  yes
0   0    1
1   1    0
2   1    0
3   1    0
4   1    0

In [175]:
new_region = pd.get_dummies(df2["region"])

In [176]:
new_region.head()

   northeast  northwest  southeast  southwest
0          0          0          0          1
1          0          0          1          0
2          0          0          1          0
3          0          1          0          0
4          0          1          0          0

In [177]:
df2.head()

   age     sex     bmi  children smoker     region      charges
0   19  female  27.900         0    yes  southwest  16884.92400
1   18    male  33.770         1     no  southeast   1725.55230
2   28    male  33.000         3     no  southeast   4449.46200
3   33    male  22.705         0     no  northwest  21984.47061
4   32    male  28.880         0     no  northwest   3866.85520

In [178]:
# concat dataset
df2 = pd.concat([df2, new_sex, new_smoker, new_region], axis=1)

In [179]:
df2.head()

,age,sex,bmi,children,smoker,region,charges,female,male,no,yes,northeast,northwest,southeast,southwest
0,19,female,27.900,0,yes,southwest,16884.92400,1,0,0,1,0,0,0,1
1,18,male,33.770,1,no,southeast,1725.55230,0,1,1,0,0,0,1,0
2,28,male,33.000,3,no,southeast,4449.46200,0,1,1,0,0,0,1,0
3,33,male,22.705,0,no,northwest,21984.47061,0,1,1,0,0,1,0,0
4,32,male,28.880,0,no,northwest,3866.85520,0,1,1,0,0,1,0,0

In [180]:
# Drop unnecessary columns
df2 = df2.drop(["sex", "smoker", "region"], axis=1,inplace=True)

In [181]:
df2.head()

AttributeError: 'NoneType' object has no attribute 'head'

Ordinal Encoding.

In [182]:
df5.head()

   age     sex     bmi  children smoker     region      charges
0   19  female  27.900         0    yes  southwest  16884.92400
1   18    male  33.770         1     no  southeast   1725.55230
2   28    male  33.000         3     no  southeast   4449.46200
3   33    male  22.705         0     no  northwest  21984.47061
4   32    male  28.880         0     no  northwest   3866.85520

In [183]:
df5.sex.unique()

array(['female', 'male'], dtype=object)

In [184]:
df5.smoker.unique()

array(['yes', 'no'], dtype=object)

In [185]:
df5.region.unique()

array(['southwest', 'southeast', 'northwest', 'northeast'], dtype=object)

In [186]:
from sklearn.preprocessing import OrdinalEncoder

In [189]:
Gender = df5.sex.unique()
order = OrdinalEncoder(categories=[Gender])
encoded = order.fit_transform(df5[["sex"]])

In [190]:
df5["sex"] = encoded
df5.head()

   age  sex     bmi  children smoker     region      charges
0   19  0.0  27.900         0    yes  southwest  16884.92400
1   18  1.0  33.770         1     no  southeast   1725.55230
2   28  1.0  33.000         3     no  southeast   4449.46200
3   33  1.0  22.705         0     no  northwest  21984.47061
4   32  1.0  28.880         0     no  northwest   3866.85520

In [192]:
Smoke = df5.smoker.unique()
order = OrdinalEncoder(categories=[Smoke])
encoded = order.fit_transform(df5[["smoker"]])

In [193]:
df5["smoker"] = encoded
df5.head()

   age  sex     bmi  children  smoker     region      charges
0   19  0.0  27.900         0     0.0  southwest  16884.92400
1   18  1.0  33.770         1     1.0  southeast   1725.55230
2   28  1.0  33.000         3     1.0  southeast   4449.46200
3   33  1.0  22.705         0     1.0  northwest  21984.47061
4   32  1.0  28.880         0     1.0  northwest   3866.85520

In [194]:
Area = df5.region.unique()
order = OrdinalEncoder(categories=[Area])
encoded = order.fit_transform(df5[["region"]])

In [195]:
df5["region"] = encoded
df5.head()

   age  sex     bmi  children  smoker  region      charges
0   19  0.0  27.900         0     0.0     0.0  16884.92400
1   18  1.0  33.770         1     1.0     1.0   1725.55230
2   28  1.0  33.000         3     1.0     1.0   4449.46200
3   33  1.0  22.705         0     1.0     2.0  21984.47061
4   32  1.0  28.880         0     1.0     2.0   3866.85520

In [196]:
df5.head()

   age  sex     bmi  children  smoker  region      charges
0   19  0.0  27.900         0     0.0     0.0  16884.92400
1   18  1.0  33.770         1     1.0     1.0   1725.55230
2   28  1.0  33.000         3     1.0     1.0   4449.46200
3   33  1.0  22.705         0     1.0     2.0  21984.47061
4   32  1.0  28.880         0     1.0     2.0   3866.85520